10/data/attachments/20c380fa177af1e4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_155782e0-0efb-4987-ac17-a2f2ef2aa06c</nif:username>
            <nif:friendToBeAdded>Tony_air_Actions_12898_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>